app/controllers/welcome_controller.rb

  def edit
    @users = current_user
    @user = User.first.update(params[:id])
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]